ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/systick.xml
<module id="SYSTICK" HW_revision=""><register id="STCSR" width="32" offset="0x10" internal="0" description="SysTick Control and Status Register"><bitfield id="ENABLE" description="Enable SysTick counter" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0" description="Counter disabled"/></bitfield><bitfield id="TICKINT" description="" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="TICKINT__0" value="0x0" description="Counting down to zero does not pend the SysTick handler"/><bitenum id="TICKINT__1" value="0x1" description="Counting down to zero pends the SysTick handler."/></bitfield><bitfield id="CLKSOURCE" description="Clock source" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="CLKSOURCE__0" value="0x0" description="External reference clock."/><bitenum id="CLKSOURCE__1" value="0x1" description="Core clock."/></bitfield><bitfield id="COUNTFLAG" description="Returns 1 if timer counted to 0 since last time this was read" begin="16" end="16" width="1" rwaccess="R/W"/></register><register id="STRVR" width="32" offset="0x14" internal="0" description="SysTick Reload Value Register"><bitfield id="RELOAD" description="Value to load into the SysTick Current Value Register when the " begin="23" end="0" width="24" rwaccess="R/W"/></register><register id="STCVR" width="32" offset="0x18" internal="0" description="SysTick Current Value Register"><bitfield id="CURRENT" description="Current value at the time the register is accessed" begin="23" end="0" width="24" rwaccess="R/W"/></register><register id="STCR" width="32" offset="0x1C" internal="0" description="SysTick Calibration Value Register"><bitfield id="TENMS" description="Reads as zero. Indicates calibration value is not known." begin="23" end="0" width="24" rwaccess="R/W"/><bitfield id="SKEW" description="Reads as one" begin="30" end="30" width="1" rwaccess="R/W"/><bitfield id="NOREF" description="Reads as one" begin="31" end="31" width="1" rwaccess="R/W"/></register></module>